---
type: KeyBasedTreeEntry
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# KeyBasedTreeEntry

`Autodesk.Revit.DB.KeyBasedTreeEntry` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetChildrenKeys | 2015 | `public IList < string > GetChildrenKeys ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Key | 2015 | `public string Key { get ; }` |
| Property | ParentKey | 2015 | `public string ParentKey { get ; }` |